[
  {
    "artist": "Beyoncé",
    "fact": "Beyoncé's name was supposed to be 'Celestine,' but her mother changed it at the last minute. The name 'Beyoncé' is actually her mother's maiden name."
  },
  {
    "artist": "Freddie Mercury",
    "fact": "Freddie Mercury designed the Queen crest himself, incorporating the zodiac signs of all four band members. He held a degree in graphic design and illustration."
  },
  {
    "artist": "BTS",
    "fact": "BTS donated over $1 million to Black Lives Matter in 2020, and their fans matched it within 24 hours. They've also given millions to UNICEF and other charities."
  },
  {
    "artist": "Shakira",
    "fact": "Shakira was rejected from her school choir because her vibrato was 'too strong.' The teacher said she sounded like a goat. She's now sold over 80 million records worldwide."
  },
  {
    "artist": "Fela Kuti",
    "fact": "Fela Kuti married 27 women in a single ceremony in 1978 to mark the anniversary of the attack on his compound. He's considered the pioneer of Afrobeat music."
  },
  {
    "artist": "ABBA",
    "fact": "ABBA wore their iconic outrageous outfits because in Sweden, clothing was tax-deductible if it wasn't suitable for everyday wear. Their accountant suggested the flashy costumes."
  },
  {
    "artist": "Bob Marley",
    "fact": "Bob Marley's final words to his son Ziggy were 'Money can't buy life.' He died at age 36 from melanoma that started in his toe, which he refused to amputate due to his Rastafarian beliefs."
  },
  {
    "artist": "Sia",
    "fact": "Sia hides her face during performances to maintain anonymity and protect her privacy. She suffers from a neurological disease called Ehlers-Danlos syndrome."
  },
  {
    "artist": "Jay-Z",
    "fact": "Jay-Z's name appears nowhere on his debut album 'Reasonable Doubt' cover, and he funded the entire album himself, selling CDs out of his car before any label signed him."
  },
  {
    "artist": "Miriam Makeba",
    "fact": "Miriam Makeba was exiled from South Africa for 31 years after testifying against apartheid at the UN. Nine countries revoked her visa, and she couldn't attend her mother's funeral."
  },
  {
    "artist": "David Bowie",
    "fact": "David Bowie's eyes appeared different colors due to a permanently dilated pupil from a childhood fight, not heterochromia. Both eyes were actually blue."

  },
  {
    "artist": "Rihanna",
    "fact": "Rihanna is the richest female musician in the world with a net worth exceeding $1.4 billion, primarily from her Fenty Beauty cosmetics line, not her music."
  },
  {
    "artist": "Daddy Yankee",
    "fact": "Daddy Yankee was training to become a professional baseball player when he was hit by a stray AK-47 bullet. He survived and decided to pursue music full-time instead."
  },
  {
    "artist": "A.R. Rahman",
    "fact": "A.R. Rahman converted to Sufism after his sister's recovery from a serious illness. He has won two Oscars, two Grammys, and is India's highest-selling music artist."
  },
  {
    "artist": "Celine Dion",
    "fact": "Celine Dion is the youngest of 14 children. Her song 'My Heart Will Go On' almost didn't happen because she initially didn't want to record another movie soundtrack."
  },
  {
    "artist": "Björk",
    "fact": "Björk wore her famous swan dress to the 2001 Oscars and laid 'eggs' on the red carpet. The dress is now in the Museum of Modern Art's permanent collection."
  },
  {
    "artist": "Bad Bunny",
    "fact": "Bad Bunny was studying to become an audiovisual communications professional while working as a supermarket bagger when his music career took off. He uploaded his songs to SoundCloud."
  },
  {
    "artist": "Yoko Ono",
    "fact": "Yoko Ono was the first person from Japan to be enrolled in the philosophy program at Gakushuin University, and her family was so wealthy they had servants taste their food for poison."
  },
  {
    "artist": "Nina Simone",
    "fact": "Nina Simone was denied entry to the prestigious Curtis Institute of Music despite acing her audition. She believed it was due to racial discrimination, which haunted her entire life."
  },
  {
    "artist": "Angelique Kidjo",
    "fact": "Angelique Kidjo has won five Grammy Awards and sung in seven languages. She was forbidden from performing in her home country Benin for several years by a dictatorial regime."
  },
  {
    "artist": "Andrea Bocelli",
    "fact": "Andrea Bocelli became completely blind at age 12 after a soccer accident, but he could already play piano, flute, saxophone, trumpet, trombone, guitar, and drums by then."
  },
  {
    "artist": "Tina Turner",
    "fact": "Tina Turner became a Swiss citizen in 2013 and relinquished her US citizenship. She bought her freedom from her abusive marriage to Ike Turner for just 36 cents and two cars."
  },
  {
    "artist": "Rosalía",
    "fact": "Rosalía spent years studying flamenco at the prestigious Catalonia College of Music despite flamenco being considered 'unfashionable.' She can sing eight hours straight without losing her voice."
  },
  {
    "artist": "Burna Boy",
    "fact": "Burna Boy's grandfather Benson Idonije was Fela Kuti's first band manager. Burna Boy became the first Nigerian artist to sell out Madison Square Garden in 2022."
  },
  {
    "artist": "Psy",
    "fact": "Psy's 'Gangnam Style' was the first YouTube video to reach 1 billion views and literally broke YouTube's view counter, which had to be upgraded from 32-bit to 64-bit integers."
  },
  {
    "artist": "Elton John",
    "fact": "Elton John legally changed his name in 1972 from Reginald Dwight. He's also the most successful male solo artist in Billboard history with over 300 million records sold."
  },
  {
    "artist": "Anitta",
    "fact": "Anitta learned English by watching Friends without subtitles and taught herself Spanish through Skype lessons. She became the first Brazilian artist to perform at Coachella."
  },
  {
    "artist": "Daft Punk",
    "fact": "Daft Punk got their name from a negative review that called their early band's music 'daft punky trash.' They wore their iconic helmets to separate their private lives from their stage personas."
  },
  {
    "artist": "Wizkid",
    "fact": "Wizkid started his music career at age 11 singing in his church choir. He was the first African artist to sell out London's Royal Albert Hall three nights in a row."
  },
  {
    "artist": "Keith Urban",
    "fact": "Keith Urban was born in New Zealand but grew up in Australia. He's won four Grammy Awards and married Nicole Kidman in 2006 after she attended one of his concerts."
  },
  {
    "artist": "Frank Ocean",
    "fact": "Frank Ocean was originally a ghostwriter for artists like Justin Bieber and John Legend before releasing his own music. He wrote for Brandy, Beyoncé, and Justin Bieber's 'Bigger.'"
  },
  {
    "artist": "Kendrick Lamar",
    "fact": "Kendrick Lamar's first name is actually Kendrick Lamar Duckworth. He witnessed his idols Tupac and Dr. Dre filming the 'California Love' music video when he was just 8 years old in Compton."
  },
  {
    "artist": "Tyler, The Creator",
    "fact": "Tyler, The Creator taught himself to play piano at age 14 and produces most of his own beats. He designed the album artwork for his early projects himself and creates most of his visual content."
  },
  {
    "artist": "J. Cole",
    "fact": "J. Cole was the first artist signed to Jay-Z's Roc Nation label in 2009. He graduated magna cum laude from St. John's University with a degree in communications and business."
  },
  {
    "artist": "Playboi Carti",
    "fact": "Playboi Carti's real name is Jordan Terrell Carter. He initially wanted to pursue basketball before focusing on music and was part of the underground Atlanta rap scene."
  },
  {
    "artist": "SZA",
    "fact": "SZA's stage name is derived from the Supreme Alphabet, with the letters meaning Savior, Zig-Zag-Zig, and Allah. She studied marine biology in college before pursuing music."
  },
  {
    "artist": "Anderson .Paak",
    "fact": "Anderson .Paak's stage name includes a period to signify 'detail' - he says the dot represents his attention to detail in his music. He was homeless in his early twenties."
  },
  {
    "artist": "Earl Sweatshirt",
    "fact": "Earl Sweatshirt's real name is Thebe Neruda Kgositsile. His father is the late South African poet and political activist Keorapetse Kgositsile, South Africa's poet laureate."
  },
  {
    "artist": "Mac Miller",
    "fact": "Mac Miller taught himself to play piano, guitar, drums, and bass by age six. His stage name 'Mac' came from his love of McDonald's as a child, and Miller is his actual last name."
  },
  {
    "artist": "Danny Brown",
    "fact": "Danny Brown is missing his front teeth from a drug-related incident in his past. He's been open about his struggles with addiction and his missing teeth have become part of his signature look."
  },
  {
    "artist": "Vince Staples",
    "fact": "Vince Staples initially started rapping because his friends needed someone to fill in for a missing member. He's known for his deadpan humor and philosophical takes in interviews."
  },
  {
    "artist": "Pusha T",
    "fact": "Pusha T wrote the iconic McDonald's 'I'm Lovin' It' jingle with Justin Timberlake. He's been open about his past as a drug dealer, which heavily influences his music content."
  },
  {
    "artist": "Denzel Curry",
    "fact": "Denzel Curry was named after actor Denzel Washington. He attended the same high school as Trayvon Martin and has spoken about how that tragedy affected him personally."
  },
  {
    "artist": "JID",
    "fact": "JID's real name is Destin Choice Route, and he played football at Hampton University on scholarship before a leg injury ended his athletic career and led him to focus on rap."
  },
  {
    "artist": "Saba",
    "fact": "Saba's full stage name represents 'Stop All Bitching and Complaining.' His 2018 album 'CARE FOR ME' was created after the death of his cousin and collaborator John Walt."
  },
  {
    "artist": "Injury Reserve",
    "fact": "Injury Reserve started as a duo of producers who met rapper Stepa J. Groggs at an open mic night in Phoenix. Sadly, Groggs passed away in 2020, and the group continued as a duo."
  },
  {
    "artist": "JPEGMAFIA",
    "fact": "JPEGMAFIA served in the U.S. Air Force and was stationed in several countries including Iraq, Japan, and Kuwait. He produces all his own music and is known for his experimental production."
  },
  {
    "artist": "Mick Jenkins",
    "fact": "Mick Jenkins' breakout mixtape 'The Water[s]' used water as a metaphor for truth throughout the project. He's known for his conscious lyrics and philosophical approach to hip-hop."
  },
  {
    "artist": "Smino",
    "fact": "Smino is from St. Louis and is part of the Zero Fatigue collective. His unique singing-rapping style and use of St. Louis slang have made him stand out in the hip-hop scene."
  },
  {
    "artist": "Freddie Gibbs",
    "fact": "Freddie Gibbs was briefly signed to Interscope Records in the 2000s but was dropped before releasing an album. He was also recruited by Warner Bros. Records but that deal fell through as well."
  },
  {
    "artist": "Travis Scott",
    "fact": "Travis Scott's real name is Jacques Bermon Webster II. He dropped out of the University of Texas at San Antonio to pursue music and initially moved to New York City, then Los Angeles."
  },
  {
    "artist": "Schoolboy Q",
    "fact": "Schoolboy Q was a member of the 52 Hoover Crips gang before pursuing music seriously. His daughter Joy appears in several of his music videos and social media posts."
  },
  {
    "artist": "Isaiah Rashad",
    "fact": "Isaiah Rashad was the first artist signed to Top Dawg Entertainment's partnership with Interscope Records. He's been open about his struggles with depression and substance abuse."
  },
  {
    "artist": "A$AP Rocky",
    "fact": "A$AP Rocky's older brother was killed when Rocky was 13, which deeply affected him. He was named after hip-hop legend Rakim and started rapping at age 8."
  },
  {
    "artist": "Joey Bada$$",
    "fact": "Joey Bada$$ was only 17 years old when he released his acclaimed debut mixtape '1999' in 2012. He was homeschooled and attended the performing arts high school in Brooklyn."
  },
  {
    "artist": "The Weeknd",
    "fact": "The Weeknd's stage name came from dropping out of high school one weekend and never returning - he dropped the 'e' to avoid copyright issues with a band already named 'The Weekend.'"
  },
  {
    "artist": "21 Savage",
    "fact": "21 Savage was actually born in London, England and moved to Atlanta at age 7. This became public knowledge during his 2019 ICE detention, shocking many fans who thought he was Atlanta-born."
  },
  {
    "artist": "Lil Uzi Vert",
    "fact": "Lil Uzi Vert got their name because someone said their rap flow was 'fast like a machine gun.' Uzi is known for their facial tattoos and had a pink diamond implanted in their forehead."
  },
  {
    "artist": "Future",
    "fact": "Future's real name is Nayvadius DeMun Wilburn. He was nicknamed 'The Future' by his original musical group The Dungeon Family because they felt he represented the future of music."
  },
  {
    "artist": "Young Thug",
    "fact": "Young Thug has 6 biological children with 4 different women. He's known for his unique fashion sense, often wearing women's clothing and challenging gender norms in hip-hop fashion."
  }
]
